# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
activation_type: silu

anchors:
  - [13,17,  31,25,  24,51, 61,45]  # P3/8
  - [61,45,  48,102,  119,96, 97,189]  # P4/16
  - [97,189,  217,184,  171,384, 324,451]  # P5/32
  - [324,451, 545,357, 616,618, 1024,1024]  # P6/64


# YOLOv8.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C2f, [128, True]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C2f, [256, True]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 6, C2f, [512, True]],
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    [-1, 3, C2f, [1024, True]],
    [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv8.0-p2 head
head:
  [
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C2f, [512]],  # 12

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C2f, [256]],  # 15 (P3/8-small)

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 2], 1, Concat, [1]],  # cat backbone P2
    [-1, 3, C2f, [128]],  # 18 (P2/4-xsmall)

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 15], 1, Concat, [1]],  # cat head P3
    [-1, 3, C2f, [256]],  # 21 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 12], 1, Concat, [1]],  # cat head P4
    [-1, 3, C2f, [512]],  # 24 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 9], 1, Concat, [1]],  # cat head P5
    [-1, 3, C2f, [1024]],  # 27 (P5/32-large)

    [[18, 21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]